УТ_для_edt/src/ChartsOfCharacteristicTypes/CRM_Классификаторы/CRM_Классификаторы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>CRM_Классификаторы</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Партнеры</types>
  </type>
  <attributes>
    <name>ВидОтображения</name>
    <type>
      <types>EnumRef.CRM_ВидыОтображенияКлассификаторов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособФормирования</name>
    <type>
      <types>EnumRef.СпособыФормированияСегментов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентноеЗадание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗаданиеGUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуемаяАналитика</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CRM_АналитикаКлассификаторов</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтерактивныйВводЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Принадлежность</name>
    <attributes>
      <name>ИмяТаблицы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

УТ_для_edt/src/Enums/CRM_ВариантыПолученияАналитикиКлассификатора/CRM_ВариантыПолученияАналитикиКлассификатора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВариантыПолученияАналитикиКлассификатора</name>
  <enumValues>
    <name>НастройкиПользователя</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныйАлгоритм</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_ВидыОтображенияКлассификаторов/CRM_ВидыОтображенияКлассификаторов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыОтображенияКлассификаторов</name>
  <enumValues>
    <name>Тег</name>
  </enumValues>
  <enumValues>
    <name>Вхождение</name>
  </enumValues>
  <enumValues>
    <name>ОдиночноеЗначение</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйРеквизит</name>
  </enumValues>
  <enumValues>
    <name>ОтдельнымСписком</name>
  </enumValues>
  <enumValues>
    <name>ОбщимСписком</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/СпособыФормированияСегментов/СпособыФормированияСегментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыФормированияСегментов</name>
  <enumValues>
    <name>ФормироватьДинамически</name>
  </enumValues>
  <enumValues>
    <name>ПериодическиОбновлять</name>
  </enumValues>
  <enumValues>
    <name>ФормироватьВручную</name>
  </enumValues>
  <enumValues>
    <name>CRM_Анкетирование</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/ChartsOfCharacteristicTypes/CRM_Классификаторы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция РасписаниеРегламентногоЗаданияПоУмолчанию() Экспорт
	
	Месяцы = Новый Массив;
	Месяцы.Добавить(1);
	Месяцы.Добавить(2);
	Месяцы.Добавить(3);
	Месяцы.Добавить(4);
	Месяцы.Добавить(5);
	Месяцы.Добавить(6);
	Месяцы.Добавить(7);
	Месяцы.Добавить(8);
	Месяцы.Добавить(9);
	Месяцы.Добавить(10);
	Месяцы.Добавить(11);
	Месяцы.Добавить(12);
	
	ДниНедели = Новый Массив;
	ДниНедели.Добавить(1);
	ДниНедели.Добавить(2);
	ДниНедели.Добавить(3);
	ДниНедели.Добавить(4);
	ДниНедели.Добавить(5);
	ДниНедели.Добавить(6);
	ДниНедели.Добавить(7);
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	Расписание.ДниНедели                = ДниНедели;
	Расписание.ПериодПовтораВТечениеДня = 3600; // 1 час
	Расписание.ПериодПовтораДней        = 1; // каждый день
	Расписание.Месяцы                   = Месяцы;
	
	Возврат Расписание;
КонецФункции

// Получает расписание регламентного задания.
// Если регламентное задание не задано, то возвращает пустое расписание (по умолчанию).
//
Функция ПолучитьРасписаниеВыполненияКлассификатора(Классификатор) Экспорт
	
	РегламентноеЗаданиеОбъект = CRM_КлассификаторыЭкспортныеМетоды.НайтиРегламентноеЗадание(Классификатор.РегламентноеЗаданиеGUID);
	
	Если РегламентноеЗаданиеОбъект <> Неопределено Тогда
		
		РасписаниеРегламентногоЗадания = РегламентноеЗаданиеОбъект.Расписание;
		
	Иначе
		
		РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
		
	КонецЕсли;
	
	Возврат РасписаниеРегламентногоЗадания;
	
КонецФункции

Процедура ОбновитьДанныеРегламентногоЗадания(Отказ, РасписаниеРегламентногоЗадания, ТекущийОбъект) Экспорт
	
	// Получаем регламентное задание по идентификатору, если объект не находим, то создаем новый.
	РегламентноеЗаданиеОбъект = СоздатьРегламентноеЗаданиеПриНеобходимости(Отказ, ТекущийОбъект);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// обновляем свойства РЗ
	УстановитьПараметрыРегламентногоЗадания(РегламентноеЗаданиеОбъект, РасписаниеРегламентногоЗадания, ТекущийОбъект);
	
	// Записываем измененное задание.
	ЗаписатьРегламентноеЗадание(Отказ, РегламентноеЗаданиеОбъект);
	
	// Запоминаем GUID регламентное задания в реквизите объекта.
	ТекущийОбъект.РегламентноеЗаданиеGUID = Строка(РегламентноеЗаданиеОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

Функция СоздатьРегламентноеЗаданиеПриНеобходимости(Отказ, ТекущийОбъект)
	
	РегламентноеЗаданиеОбъект = CRM_КлассификаторыЭкспортныеМетоды.НайтиРегламентноеЗадание(ТекущийОбъект.РегламентноеЗаданиеGUID);
	
	// При необходимости создаем регламентное задание.
	Если РегламентноеЗаданиеОбъект = Неопределено Тогда
		
		РегламентноеЗаданиеОбъект = РегламентныеЗадания.СоздатьРегламентноеЗадание("CRM_ФормированиеСоставаЗначенийКлассификаторов");
		
	КонецЕсли;
	
	Возврат РегламентноеЗаданиеОбъект;
	
КонецФункции

Процедура УстановитьПараметрыРегламентногоЗадания(РегламентноеЗаданиеОбъект, РасписаниеРегламентногоЗадания, ТекущийОбъект)
		
	ПараметрыРегламентногоЗадания = Новый Массив;
	ПараметрыРегламентногоЗадания.Добавить(ТекущийОбъект.Ссылка);
	
	НаименованиеРегламентногоЗадания = НСтр("ru='Формирование состава значений классификатора: %1';en='Formation of the classifier values:%1'");
	НаименованиеРегламентногоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НаименованиеРегламентногоЗадания, СокрЛП(ТекущийОбъект.Наименование));
	
	РегламентноеЗаданиеОбъект.Наименование  = Лев(НаименованиеРегламентногоЗадания, 120);
	РегламентноеЗаданиеОбъект.Использование = ТекущийОбъект.ИспользоватьРегламентноеЗадание;
	РегламентноеЗаданиеОбъект.Параметры     = ПараметрыРегламентногоЗадания;
	
	// Обновляем расписание, если оно было изменено.
	Если РасписаниеРегламентногоЗадания <> Неопределено Тогда
		РегламентноеЗаданиеОбъект.Расписание = РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
КонецПроцедуры

// Выполняет запись регламентного задания.
//
// Параметры:
//  Отказ                     - Булево - флаг отказа. Если в процессе выполнения процедуры были обнаружены ошибки,
//                                       то флаг отказа устанавливается в значение Истина.
//  РегламентноеЗаданиеОбъект - объект регламентного задания, которое необходимо записать.
// 
Процедура ЗаписатьРегламентноеЗадание(Отказ, РегламентноеЗаданиеОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		// записываем задание
		РегламентноеЗаданиеОбъект.Записать();
		
	Исключение
		
		СтрокаСообщения = НСтр("ru='Произошла ошибка при сохранении расписания. Подробное описание ошибки: %1';en='An error occurred while saving the schedule. Detailed error description:%1'");
		СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбменДаннымиСервер.СообщитьОбОшибке(СтрокаСообщения, Отказ);
		
	КонецПопытки;
	
КонецПроцедуры

// Помещает во временное хранилище схему компоновки данных,
// настройки компоновки данных и возвращает их адреса
//
// Параметры:
//	ЦельСсылка - Ссылка, СправочникСсылка.скНастройкиЗапускаБизнесПроцессовОбъектов - цель, для которой требуется получить адреса
//
// Возвращаемое значение:
//	Структура - структура, содержащая адреса
//				СхемаКомпоновкиДанных - Строка - адрес схемы компоновки данных
//				НастройкиКомпоновкиДанных - Строка - адрес настроек компоновки данных
//
Функция АдресаСхемыКомпоновкиДанныхИНастроекВоВременномХранилище(ЭлементНастройки) Экспорт
	
	Адреса = Новый Структура("СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных");
	
	Если ТипЗнч(ЭлементНастройки) = Тип("ДанныеФормыСтруктура") Тогда
		ЭлементНастройкиСсылка = ЭлементНастройки.Ссылка;
	Иначе
		ЭлементНастройкиСсылка = ЭлементНастройки;
	КонецЕсли;
	
	// Получим схему компоновки данных
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных();
	
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "НаборДанных";
	НаборДанных.ИсточникДанных = "ИсточникДанных";
	НаборДанных.Запрос = CRM_КлассификаторыЭкспортныеМетоды.СформироватьТекстЗапросаПринадлежностиКлассификатора(ЭлементНастройки);
		
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	ДетальнаяГруппировка = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ДетальнаяГруппировка.Использование = Истина;
	
	ВыбранноеАвтоПоле = Настройки.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеАвтоПоле.Использование = Истина;
		
	Адреса.СхемаКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	
	Настройки = ЭлементНастройкиСсылка.ХранилищеНастроекКомпоновкиДанных.Получить();
	Если ЗначениеЗаполнено(Настройки) Тогда
		Адреса.НастройкиКомпоновкиДанных = ПоместитьВоВременноеХранилище(Настройки, Новый УникальныйИдентификатор());
	КонецЕсли;
	
	Возврат Адреса;
	
КонецФункции

Функция ПринадлежностьКлассификаторов() Экспорт

	СписокПринадлежность = Новый СписокЗначений;
	
	ТипЗначения = Метаданные.ПланыВидовХарактеристик.CRM_Классификаторы.Тип;
	Типы 		= ТипЗначения.Типы();
	
	КоличествоТипов  = Типы.Количество();	
	Для Инд = 1 По КоличествоТипов Цикл
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(Типы[Инд - 1]);
		Если МетаданныеОбъекта = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СписокПринадлежность.Добавить(МетаданныеОбъекта.ПолноеИмя(), МетаданныеОбъекта.Представление());
		
	КонецЦикла;	
	
	Возврат СписокПринадлежность;

КонецФункции // ПринадлежностьКлассификаторов()

#Область ОбновлениеИнформационнойБазы

Процедура ВключениеИспользованияТегов() Экспорт
	
	Если НЕ Константы.ИспользоватьРазделениеПоОбластямДанных.Получить() Тогда
		ПВХАналитика = ПланыВидовХарактеристик.CRM_АналитикаКлассификаторов.СоздатьЭлемент();
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.СтруктураПредприятия"));
		ПВХАналитика.ТипЗначения = Новый ОписаниеТипов(МассивТипов);
		ПВХАналитика.Наименование = "Подразделение";
		ПВХАналитика.ВариантПолучения = Перечисления.CRM_ВариантыПолученияАналитикиКлассификатора.НастройкиПользователя;
		ПВХАналитика.Записать();
		
		ПВХКлассификатор = ПланыВидовХарактеристик.CRM_Классификаторы.СоздатьЭлемент();
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.Партнеры"));
		ПВХКлассификатор.ТипЗначения = Новый ОписаниеТипов(МассивТипов);
		ПВХКлассификатор.Наименование = "Теги";
		ПВХКлассификатор.ВидОтображения = Перечисления.CRM_ВидыОтображенияКлассификаторов.Тег;
		ПВХКлассификатор.СпособФормирования = Перечисления.СпособыФормированияСегментов.ФормироватьВручную;
		ПВХКлассификатор.ИспользуемаяАналитика = ПВХАналитика.Ссылка;
		ПВХКлассификатор.ИнтерактивныйВводЗначений = Истина;
		СтрПринадлежность = ПВХКлассификатор.Принадлежность.Добавить();
		СтрПринадлежность.ИмяТаблицы = "Справочник.Партнеры";
		ПВХКлассификатор.Записать();
		
		Константы.CRM_ИспользоватьКлассификаторы.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#КонецЕсли
